Revit 2024 API
IIFCImporterServer.ImportIFC Method
 The method that Revit will invoke to perform an import from IFC.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
void ImportIFC(
	ImporterIFC importer
)
Visual Basic
Sub ImportIFC ( _
	importer As ImporterIFC _
)
Visual C++
void ImportIFC(
	ImporterIFC^ importer
)
Parameters
importer
Type: Autodesk.Revit.DB.IFC.ImporterIFC
 The IFC importer.
See Also
IIFCImporterServer Interface
Autodesk.Revit.DB.IFC Namespace